---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedProfileType
source: html/a0dc2699-b4d8-ec64-c053-783aee58a005.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedProfileType Property

The mapped shape of the straight.

## Syntax (C#)
```csharp
public ConnectorProfileType MappedProfileType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration